{
  "status": "success",
<<<<<<< HEAD
  "approval_risk": "{\n  \"risk_score\": 32,\n  \"risk_level\": \"MEDIUM\",\n  \"risk_reasons\": [\n    \"Requester device has served 11 different national IDs within 30 days (possible service-office or shared device; elevates impersonation risk).\",\n    \"Requester device/IP is in Dammam while the approver is in Riyadh; city split itself is not a red flag (historically the citizen requests from Dammam) but still an additional coordination step that fraudsters sometimes exploit.\",\n    \"Mild spike in last-24 h activity (12 total requests, 2 for the same operation with 1 rejection) may indicate repeated attempts or coaching.\",\n    \"Operation is of medium sensitivity (opening a bank account) – consequence of successful impersonation is non-trivial.\"\n  ],\n  \"overall_assessment\": \"The main concern is that the requester’s Android device appears to be used for many identities, suggesting a shared or commercial device pattern. Geographic separation between requester (Dammam) and approver (Riyadh) is consistent with the citizen’s past behaviour but still slightly increases coordination risk. Approval came from a familiar city and a device pattern that fits the user’s historical approvals, and all user-supplied data matches official records. Taken together, there are a few moderate anomalies but no reinforcing high-risk cluster. Probability of impersonation is assessed as moderate, not high.\",\n  \"analysis_confidence\": 65\n}"
=======
  "approval_risk": "{\n  \"risk_score\": 65,\n  \"risk_level\": \"HIGH\",\n  \"risk_reasons\": [\n    \"Extreme spike of rejected approvals: 5 000 rejections for the SAME ‘OPEN_BANK_ACCOUNT’ operation and 500 additional rejections for other operations within the last 24 h. This indicates a requester persistently trying to obtain approval from the same citizen and being refused many times before finally succeeding.\",\n    \"First-time-used-for-target flag is FALSE, meaning the same requester device has already been used for this national-ID. Coupled with the large rejection count, this pattern looks like repeated fraud attempts rather than a normal follow-up request.\",\n    \"The operation is tagged HIGH sensitivity (opening a bank account). When many failed attempts precede a high-sensitivity action, the risk of coercion or eventual fatigue-approval rises sharply.\",\n    \"Although no VPN or IP city mismatch is observed, the absence of positive “normal-behavior” signals (e.g., historical matching location, consistent device session, vetting consistency) leaves the above anomalies largely unexplained.\"\n  ],\n  \"overall_assessment\": \"The same device has hammered the citizen with thousands of account-opening requests in the last 24 hours, all of which were rejected until the present approval. This persistence, combined with the high-sensitivity nature of the request, strongly suggests an impersonation or coercion scenario even though the network indicators look clean.\",\n  \"analysis_confidence\": 60\n}"
>>>>>>> origin/visual-scanner-cleanup
}